In [29]:
import pandas as pd
import numpy as np
import mplfinance as mpf
import tushare as ts
import jqdatasdk as jq

In [2]:
ts.set_token('73252a830bcd894cad3daeb2b02beb626e6b91be457bdaef34878765')

In [7]:
# df = ts.pro_bar(ts_code='000001.SH',
#                     freq='1min', 
#                     start_date='2008-01-07 09:00:00', 
#                     end_date='2008-01-08 17:00:00')

In [8]:
jqdatasdk.auth("15011559175", "Zengrongjun19")

auth success

In [31]:
jq.is_auth()

True

In [34]:
jq.get_query_count()

{'total': 1000000, 'spare': 15470}

In [14]:
from datetime import datetime

In [23]:
end_date = "2005-10-10 16:00"
end_dt = datetime.strptime(end_date, "%Y-%m-%d %H:%M")

df = jqdatasdk.get_bars("000001.XSHG", count=10, unit="30m", end_dt=end_dt)

In [27]:
df

               date     open      high       low    close
0  2005-09-30 14:30  1155.25  1157.324  1154.682  1156.29
1  2005-09-30 15:00  1156.32  1158.200  1153.712  1155.61
2  2005-10-10 10:00  1153.04  1153.398  1143.188  1143.20
3  2005-10-10 10:30  1143.03  1149.638  1142.375  1149.02
4  2005-10-10 11:00  1148.99  1149.408  1146.177  1146.69
5  2005-10-10 11:30  1146.69  1147.845  1141.903  1142.53
6  2005-10-10 13:30  1142.70  1144.303  1140.532  1141.67
7  2005-10-10 14:00  1141.70  1145.559  1140.695  1145.23
8  2005-10-10 14:30  1145.69  1145.811  1142.899  1143.62
9  2005-10-10 15:00  1143.51  1143.754  1137.289  1138.95

In [28]:
df.dtypes

date      object
open     float64
high     float64
low      float64
close    float64
dtype: object

In [26]:
df["date"] = df["date"].apply(lambda x: str(x)[:-3])

In [35]:
dd = pd.read_csv("../data/000001.XSHG_1m_sticks.csv")

In [36]:
dd.shape

(984480, 6)

In [37]:
dd.head()

               Date     Open      High       Low    Close      Volume
0  2005-01-04 09:31  1260.78  1260.782  1253.899  1254.18  14845900.0
1  2005-01-04 09:32  1252.97  1252.969  1250.711  1250.71   5069200.0
2  2005-01-04 09:33  1241.05  1247.469  1239.684  1247.47   7004800.0
3  2005-01-04 09:34  1240.49  1244.192  1238.758  1239.89   5991700.0
4  2005-01-04 09:35  1239.86  1239.856  1238.187  1238.97  10743000.0

In [38]:
dd.tail()

                    Date     Open     High      Low    Close       Volume
984475  2021-11-19 14:56  3559.41  3559.90  3559.41  3559.62  220881000.0
984476  2021-11-19 14:57  3559.74  3560.20  3559.63  3560.20  241629100.0
984477  2021-11-19 14:58  3559.83  3559.99  3559.83  3559.99   13125100.0
984478  2021-11-19 14:59  3559.99  3559.99  3559.99  3559.99          0.0
984479  2021-11-19 15:00  3559.99  3560.37  3559.95  3560.37  404876800.0

In [39]:
dd.dtypes

Date       object
Open      float64
High      float64
Low       float64
Close     float64
Volume    float64
dtype: object

In [43]:
dd.head()

                 Date     Open      High       Low    Close      Volume
0 2005-01-04 09:31:00  1260.78  1260.782  1253.899  1254.18  14845900.0
1 2005-01-04 09:32:00  1252.97  1252.969  1250.711  1250.71   5069200.0
2 2005-01-04 09:33:00  1241.05  1247.469  1239.684  1247.47   7004800.0
3 2005-01-04 09:34:00  1240.49  1244.192  1238.758  1239.89   5991700.0
4 2005-01-04 09:35:00  1239.86  1239.856  1238.187  1238.97  10743000.0

In [41]:
dd['Date'] = pd.to_datetime(dd['Date'])

In [42]:
dd.dtypes

Date      datetime64[ns]
Open             float64
High             float64
Low              float64
Close            float64
Volume           float64
dtype: object

In [48]:
save_path = "../result/000001.XSHG_1m_candlestick.png"
data = pd.read_csv("../data/000001.XSHG_1m_sticks.csv")
data = data[data.Date < "2005-01-05"]
# data = cal_macd(data)

In [47]:
data.head()

               Date     Open      High       Low    Close      Volume
0  2005-01-04 09:31  1260.78  1260.782  1253.899  1254.18  14845900.0
1  2005-01-04 09:32  1252.97  1252.969  1250.711  1250.71   5069200.0
2  2005-01-04 09:33  1241.05  1247.469  1239.684  1247.47   7004800.0
3  2005-01-04 09:34  1240.49  1244.192  1238.758  1239.89   5991700.0
4  2005-01-04 09:35  1239.86  1239.856  1238.187  1238.97  10743000.0

In [49]:
data.shape

(240, 6)